[
  {
    "companies": "HDFC",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "-0.125",
        "text": "Unbelievable. So source of tracking succession on hdfc bank was being in next building! Is this how research is done these days? https://t.co/uoMP09z4PR",
        "support_count": "276",
        "polarity": "-0.125"
      }
    ]
  },
  {
    "companies": "NTPC",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "-0.1",
        "text": ".@ntpclimited collaborates with @DelhiJalBoard to convert Waste into Energy\n\nNTPC is taking various steps to make its energy portfolio greener and plans to have 60 GW capacity through Renewable Energy sources by 2032.\n\nRead here: https://t.co/WwTUHxBmh3",
        "support_count": "57",
        "polarity": "-0.1"
      }
    ]
  },
  {
    "companies": "RELIANCE",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "0.0",
        "text": "BREAKING: Denmark plans to temporarily increase North Sea gas production to reduce its reliance on Russian gas",
        "support_count": "34854",
        "polarity": "0.0"
      },
      {
        "rank": "2",
        "sentiment": "-0.11875",
        "text": "Every so often you have to remind yourself that the UK is one of the richest nations on Earth. To reach this point - of such wide reliance on foodbanks - required years of extreme mismanagement, pointless cuts in services and concentration of wealth. \nhttps://t.co/mB4BOtRb43",
        "support_count": "3256",
        "polarity": "-0.11875"
      },
      {
        "rank": "3",
        "sentiment": "-0.029236812",
        "text": "We've set out our bold new plans to tackle illegal migration, control our borders &amp; crack down on the people-smuggling trade:\n\n🇬🇧🤝🇷🇼 New international migration partnership\n✅ Military command to tackle small boats crossings.\n✅ New asylum centres.\n✅ Ending reliance on hotels. https://t.co/oPZ6MDuDzz",
        "support_count": "2299",
        "polarity": "-0.029236812"
      },
      {
        "rank": "4",
        "sentiment": "0.375",
        "text": "In #Gandhi’s house I was taught how to spin the “charkha” - a symbol of self-reliance, perseverance, determination and freedom. May it also be a reminder of the will and commitment that we need to make the world a healthier, safer, fairer, more sustainable and peaceful place. 🙏 https://t.co/AnBMmwzTdm",
        "support_count": "1987",
        "polarity": "0.375"
      },
      {
        "rank": "5",
        "sentiment": "0.14285715",
        "text": "There are scare stories on the front of right wing papers today about how “Labor will drive up power prices” but here is the actual truth they won’t report: reliance on coal and gas means bill are ALREADY going up",
        "support_count": "1653",
        "polarity": "0.14285715"
      },
      {
        "rank": "6",
        "sentiment": "0.055555556",
        "text": "“It’s not that I am trying to do social engineering around people using bikes, walking &amp; transit. I am trying to undo the 60+ years of social engineering around the complete reliance on the automobile.” — well said @gabe_klein. #cardependency https://t.co/W4cLQILkCe",
        "support_count": "1170",
        "polarity": "0.055555556"
      },
      {
        "rank": "7",
        "sentiment": "0.37222221",
        "text": "BREAKING: I just announced our state's first-ever Clean Energy Plan—a roadmap to lower energy bills and prices at the pump, reduce reliance on out-of-state energy sources, and invest in job training and apprenticeships in innovative industries and technologies. https://t.co/AffngDmODN",
        "support_count": "1075",
        "polarity": "0.37222221"
      },
      {
        "rank": "8",
        "sentiment": "0.51111114",
        "text": "Look at how Somaliland moved swiftly to mobilise funds to help victims of market fire. \n\nIn just two weeks, 988 victims identified, 1.8m USD disbursed and more to come.\n\nImpressive show of what a functional order, social cohesion, self-reliance and mutual solidarity can achieve. https://t.co/1Sm3ogCBK9",
        "support_count": "947",
        "polarity": "0.51111114"
      },
      {
        "rank": "9",
        "sentiment": "0.0",
        "text": "DRDO salutes the exemplary contributions of Brig (Dr) SK Salwan, AVSM, VSM (Retd) &amp; former Emeritus Scientist, DRDO. His techno-managerial leadership across the spectrum of Missiles, Armaments, Explosives Safety and Strategic Systems strengthened self-reliance in Defence. https://t.co/3g9dIpIQv5",
        "support_count": "805",
        "polarity": "0.0"
      },
      {
        "rank": "10",
        "sentiment": "-0.05",
        "text": "Govt energy strategy had to cut reliance on Russian gas, slash bills &amp; secure a safe climate - it failed on all fronts\n\nInstead what we got yesterday was @KwasiKwarteng not denying reports of scrapping green levies which *cut* energy costs\n\nUtterly absurd\n\nhttps://t.co/KsslGzbseo",
        "support_count": "445",
        "polarity": "-0.05"
      }
    ]
  }
]