[
  {
    "companies": "HDFC",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "0.1",
        "text": "😂😭Best meme on #hdfcbank and #HDFC merger so far! Via @vimsicle \n#RRR #Naatu https://t.co/rZ77K4Hvb2",
        "support_count": "4268",
        "polarity": "0.1"
      },
      {
        "rank": "2",
        "sentiment": "-0.072222225",
        "text": "So much of social media, e-com, mails, e comm sites, apps - Netflix, Amazon, Hotstar, hdfc, youtube, axis, I have no more password combinations left in me🤔🤨🙇‍♂️💭 https://t.co/wZmrZzWt6K",
        "support_count": "603",
        "polarity": "-0.072222225"
      },
      {
        "rank": "3",
        "sentiment": "0.0",
        "text": "Why the Punjab Police service account has been given to @HDFC_Bank despite having number of PSU's. \n\nI request the CM @BhagwantMann &amp; @HarpalCheemaMLA to look into this.\n\n#hdfcbank",
        "support_count": "298",
        "polarity": "0.0"
      }
    ]
  },
  {
    "companies": "RELIANCE",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "0.36666667",
        "text": "There is no obstacle that cannot be overcome if the nation forges unity in its ranks &amp; has the determination to succeed against odds. Quaid-i-Azam's motto of \"work, work &amp; work \" is a beacon light for the nation to galvanize itself in the pursuit of self-reliance &amp; bright future.",
        "support_count": "4506",
        "polarity": "0.36666667"
      },
      {
        "rank": "2",
        "sentiment": "-0.071428575",
        "text": "The big hike in energy bills from today shows us we are short of electricity and gas. The government needs to take more urgent action to increase domestic supply and end our dangerous and expensive reliance on imports.",
        "support_count": "4411",
        "polarity": "-0.071428575"
      },
      {
        "rank": "3",
        "sentiment": "0.275",
        "text": "For those misinterpreting my remark, it has always been my conviction that true independence comes from self-reliance. The concept of sovereignty is incomplete without economic sovereignty, which cannot be achievd without 'blood, sweat and tears'. https://t.co/mEekko1tCP",
        "support_count": "4029",
        "polarity": "0.275"
      },
      {
        "rank": "4",
        "sentiment": "0.25",
        "text": "The over-reliance on Babar Azam and Mohammad Rizwan is there for all to see, as the so-called finishers in the middle-order are doing nothing most of the time #PAKvAUS #Cricket",
        "support_count": "3334",
        "polarity": "0.25"
      },
      {
        "rank": "5",
        "sentiment": "0.25555557",
        "text": "The Conservatives have had 12 years to end the UK’s reliance on imported fossil fuels. \n \nThey chose not to. \n \nLabour is on your side. We would introduce cheap, clean, British renewables and nuclear energy. https://t.co/o2CYcCO85M",
        "support_count": "2013",
        "polarity": "0.25555557"
      },
      {
        "rank": "6",
        "sentiment": "0.07472222",
        "text": "Our country's reliance on fossil fuels empowers dictators like Putin. I stand with a broad coalition of groups calling for action to get our economy off of fossil fuels and double down on clean energy investments. The time to act is now. https://t.co/xSpMxeSqH3",
        "support_count": "1881",
        "polarity": "0.07472222"
      },
      {
        "rank": "7",
        "sentiment": "0.0",
        "text": "Electric vehicles will decrease our reliance on fossil fuels, but it will massively increase our reliance on China! \n\nHunter Biden has helped the Chinese buy cobalt mines to make electric batteries, while @JoeBiden pushes us toward electric cars. 🤔🤔🤔",
        "support_count": "1122",
        "polarity": "0.0"
      },
      {
        "rank": "8",
        "sentiment": "0.05",
        "text": "\"They'll make up any old cobblers...\"\n\nLabour's @Ed_Miliband reacts to Tory chair Oliver Dowden blaming Labour for the UK’s “reliance” on Russian oil and gas.\n\n#KayBurley JP https://t.co/n3yjXFeLPw",
        "support_count": "1039",
        "polarity": "0.05"
      },
      {
        "rank": "9",
        "sentiment": "0.14090909",
        "text": "Indigenous Defence prowess shaping the new India, an #AatmanirbharBharat!\n\nIn a continuous pursuit of self-reliance, MoD has notified the third positive indigenisation list comprising 101 weapons/systems/platforms/equipment. https://t.co/cHIMlEtO0K",
        "support_count": "816",
        "polarity": "0.14090909"
      },
      {
        "rank": "10",
        "sentiment": "-0.041666668",
        "text": "There are many possible critiques of Pakistan’s reliance on IMF/foreign aid, but we are outraging over how mere admission of such dependence insults our national pride\n\nFamily, community, nation - our destructive obsession with defending “ghairat” is frighteningly easy to exploit",
        "support_count": "712",
        "polarity": "-0.041666668"
      }
    ]
  },
  {
    "companies": "ITC",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "-0.0125",
        "text": "Greece will ramp up coal mining to help cut reliance on gas. \n\nNot exactly a climate friendly switch, but energy security trumps emissions, at least for next 5+ years. \n\nhttps://t.co/gjZZDgsEuM",
        "support_count": "191",
        "polarity": "-0.0125"
      }
    ]
  }
]