[
  {
    "companies": "ZOMATO",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "-0.12222222",
        "text": "Hey @zomato instead of pushing your hapless delivery partners into 10 minute orders while so many of them struggle on cycles in the heat, maybe at least streamline systems enough for normally timed deliveries . Every time I’ve used you past few weeks massive delays, poor response",
        "support_count": "320",
        "polarity": "-0.12222222"
      },
      {
        "rank": "2",
        "sentiment": "-0.5",
        "text": "urgent attention🚨\n\n@zomato @zomatocare \n\nI wouldn't want call to you this but you are an \"exploiter\"\n\nFrom not paying the delivery executive enough, promoting bizzare and menacing strategy like \"10 minutes delivery\" to ignoring the health and care of delivery executive.\n\n ++++",
        "support_count": "212",
        "polarity": "-0.5"
      }
    ]
  },
  {
    "companies": "GLAND",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "0.0",
        "text": "Welp—just got denied Paxlovid by my healthcare plan. Got told they will only give out to severely immunocompromised—like organ transplant, chemotherapy, or HIV. So, not having a thymus gland doesn’t qualify🤷🏻‍♂️. (“T-cells” officially called thymus-derived lymphocytes)\n\nMeanwhile: https://t.co/HmxDa1RO0u",
        "support_count": "9185",
        "polarity": "0.0"
      },
      {
        "rank": "2",
        "sentiment": "0.21011905",
        "text": "3) I do wish I had all of my right lung 🫁 though - lost part of it when I was 17 years old. A thymus gland would give me more peace of mind too. But such is life. Many people have unseen immunocompromised/ risk factors. Let’s all try to protect each other. 🙏 https://t.co/AC0WrjA0VP",
        "support_count": "3499",
        "polarity": "0.21011905"
      },
      {
        "rank": "3",
        "sentiment": "0.11333334",
        "text": "3) I lost my thymus gland when I was 17 years old. T-cell maturation mostly happens when you’re young and in teenage years. So its borderline debatable how immunocompromised I am. But thymus can stay active until 40s. https://t.co/AC0WrjA0VP",
        "support_count": "1469",
        "polarity": "0.11333334"
      }
    ]
  },
  {
    "companies": "ITC",
    "top_tweets": [
      {
        "rank": "1",
        "sentiment": "0.0",
        "text": "Peter Thiel says a “finance gerontocracy” — Warren Buffett, Jamie Dimon and Larry Fink — is keeping #Bitcoin from reaching $100,000. Billionaire calls Berkshire CEO a ‘sociopathic grandpa.’ https://t.co/XlRn0jq9vn https://t.co/JQQVXLwtSk",
        "support_count": "2464",
        "polarity": "0.0"
      },
      {
        "rank": "2",
        "sentiment": "0.25",
        "text": "🚨 PSA 🚨 \n\nBitcoin is inevitable\nBitcoin is for everyone\nR.I.P 1949 Finance 🦖\n\nSpread the word (🔁) to unlock up to 200x Blinko (BTC) bonuses through the end of the day.\n\n + we're going to give one of y'all 1M sats 🤯. Be sure to hit follow so we can DM you. \n\nDeets below 👇",
        "support_count": "910",
        "polarity": "0.25"
      }
    ]
  }
]